[
  {
    "Latitude": 20.02055677434311,
    "Longitude": -155.66691201702352,
    "HeaderImg": "images/waimea_sakura.jpg",
    "Name": "Cherry Blossom Festival (Waimea)",
    "Address": "67-1175 Hawaii Belt Rd, Waimea (Kamuela), HI 96743",
    "2024 Event Dates": "February 3, 2024",
    "Link": "https://www.jcchawaii.org/events/2024-waimea-cherry-blossom",
    "Description": "Waimea Cherry Blossom Heritage Festival: Visit the JCCH booth for fun, family-friendly activities and information about our upcoming programs and events! We will be located at the Historic Church Row Park (in front of the Kamuela Hongwanji Mission Open House). The Official Festival Portal link below contains the entertainment schedule, activity line-up, and festival map. To be a vibrant resource, strengthening our diverse community by educating present and future generations in the evolving Japanese American experience in Hawai‘i. We do this through relevant programming, meaningful community service, and innovative partnerships that enhance the understanding and celebration of our heritage, culture, and love of the land. To guide us in this work we draw from the values found in our Japanese American traditions and the spirit of Aloha. The JCCH is built upon the Kachikan values that have been brought over from Japan by the Issei pioneers. These values have been passed down for generations and ties us to the shared values in our community and our neighbors, regardless of ethnicity. View our Kachikan values here."
  },
  {
    "Latitude": 33.26456337,
    "Longitude": -117.2850335,
    "HeaderImg": "images/sandiego_sakura.jpg",
    "Name": "Cherry Blossom Festival (San Diego)",
    "Address": "2215 Pan American E Rd, San Diego, CA 92101",
    "2024 Event Dates": "March 7-10, 2024",
    "Link": "https://www.niwa.org/cbw",
    "Description": "The mission of the Japanese Friendship Garden & Museum (JFGM) is to develop a traditional Japanese garden as a center to educate, engage, and inspire people of diverse backgrounds about Japanese culture and community legacy. JFGM is an accredited museum that offers a variety of educational programs, exhibits, and cultural festivals to enhance appreciation and understanding of Japanese culture. Over 330,000 visitors from the United States and internationally attend the garden annually. JFGM opened to the public in 1991 and is an expression of friendship between San Diego and its sister city, Yokohama. The garden is inspired from centuries-old Japanese design and techniques that showcase JFGM’s living exhibition comprised of plants and florae native to Japan and San Diego. The second phase opened in 1999 and was designed by renowned landscape architect Takeo Uesugi, which included the addition of the Exhibit Hall, Activity Center, and Upper Koi Pond. The third phase, completed in 2015, incorporated a 200 cherry tree grove, large azalea and camellia garden, a water feature reminiscent of the San Diego watershed, and the state of the art Inamori Pavilion. Today, JFGM resides on 12 acres and fosters a relationship between humans and nature, providing a respite attuned to Japanese simplicity, serenity, and aestheticism."
  },
  {
    "Latitude": 32.833323836892944,
    "Longitude": -83.61522869746821,
    "HeaderImg": "images/macon_sakura.jpg",
    "Name": "International Cherry Blossom Festival (Macon)",
    "Address": "Carolyn Crayton Park, Macon, GA 31201",
    "2024 Event Dates": "March 15-24, 2024",
    "Link": "https://cherryblossom.com/",
    "Description": "Yoshino cherry trees in Macon typically bloom the last week of March depending on how cold the winter has been and when the temperatures begin to warm up. Their beautiful blooms last roughly two weeks if there isn’t an abundance of rain. If you have never experienced Macon in bloom, we highly recommend following the Cherry Blossom Trail, which guides visitors on a blossom-filled route throughout the city. The Trail begins at the Visitor’s Center in lovely downtown Macon and includes Wesleyan Drive, home to the founder of the Festival, and where Carolyn Crayton envisioned thousands of trees being planted. You can follow the trail at your own pace, and you’ll enjoy glimpses of Macon’s many historic buildings. Macon contains 12 historic districts and over 6,500 structures that are designated on the National Register of Historic Places."
  },
  {
      "Latitude": 38.88405707545142,
      "Longitude": -77.03852848716569,
      "HeaderImg": "images/washington_sakura.png",
      "Name": "National Cherry Blossom Festival (DC)",
      "Address": "Tidal Basin, Washington DC",
      "2024 Event Dates": "March 20-April 13",
      "Link": "https://nationalcherryblossomfestival.org/",
      "Description": "What began with a gift in 1912 at the Tidal Basin now spans four weeks throughout Washington, DC, and neighboring communities in Maryland and Virginia. Residents and visitors are invited to celebrate all that spring in Washington, DC has to offer — from exciting events to convenient hotels, delectable Cherry Picks restaurants to vibrant Art in Bloom installations, and a jaw-dropping City in Bloom to joyful Petal Porches. The Sakura Matsuri – Japanese Street Festival is the largest celebration of Japanese culture in the United States. The festival features over 24 hours of Japanese cultural performances on four stages (including J-Pop, traditional Japanese music, and martial arts) and a diverse range of cultural exhibitors, artisan and commercial vendors of traditional and contemporary Japanese goods, and Japanese and other food and beverages. The festival also spotlights travel and tourism opportunities and innovative Japanese technologies."
  },
  {
    "Latitude": 33.6633394284504,
    "Longitude": -83.93184513318894,
    "HeaderImg": "images/conyers_sakura.jpg",
    "Name": "City of Conyers Cherry Blossom Festival (Conyers)",
    "Address": "1996 Centennial Olympic Pkwy NE, Conyers, GA 30013",
    "2024 Event Dates": "March 23-24, 2024",
    "Link": "https://www.georgiahorsepark.com/p/calendar-of-events/conyers-cherry-blossom-festival",
    "Description": "Spring it On at the Conyers Cherry Blossom Festival! Shop among unique art and craft exhibitors, eat your way through the multiple food courts, enjoy cultural performances, listen to live music, and play in the children’s area. The Cherry Blossom Festival originated as a way to encourage cultural understanding and friendship through international music, dance, games, food and crafts. The cherry blossom is a symbol of short-lived beauty in Japan, and the City of Conyers embraces this tradition as well. The blooming of the cherry trees offers a time to reflect upon our lives. Like the blooming of the trees, life is short, so you have to appreciate and embrace it. The Conyers Cherry Blossom Festival has received many awards over the years for Best Event in the Southeast by the Southeast Festival and Events Association. It has also been selected over the years as a Top 20 Event in the Southeast by the Southeast Tourism Society for multiple years. Most recently the festival was selected as a Signature Event in the Southeast by the Southeast Tourism Society!"
  },
  {
    "Latitude": 45.518838564039925,
    "Longitude": -122.70799025202598,
    "HeaderImg": "images/portland_sakura.png",
    "Name": "Cherry Blossom Watch (Portland)",
    "Address": "611 SW Kingston Ave, Portland, OR 97205",
    "2024 Event Dates": "April 5th, 2024",
    "Link": "https://japanesegarden.org/2024-cherry-blossom-watch/",
    "Description": "In Portland Japanese Garden, the arrival of spring is often heralded by the awakening of our cherry blossoms. Our delicate and beautiful Yoshino and Weeping Cherry trees glow with the whites and pinks we sorely missed during the gray days of winter. While every year is different, the Garden typically sees blooms beginning at the end of March and through the first few weeks of April. Make sure you stay tuned to this space, as we will regularly update it with photos of the state of our cherry blossoms, beginning in mid-March. Friday, April 5 marks the final day we’ll update our 2024 Cherry Blossom Watch page. While some flowers are still in bloom, petals have begun to rapidly drop from the trees next to the Umami Café and in the Strolling Pond Garden, creating an almost snow-like blanket in some areas. While it may be bittersweet to see these delicate harbingers of spring leave until next year, it is nonetheless an exciting time for Portland Japanese Garden as we now enter into shinryoku, the next phase of spring that sees green foliage following the departure of sakura (cherry blossoms)."
  },
  {
    "Latitude": 37.7854,
    "Longitude": -122.429,
    "HeaderImg": "images/sanfran_sakura.jpg",
    "Name": "Northern California Cherry Blossom Festival (San Francisco)",
    "Address": "1610 Geary Blvd, San Francisco, CA 94115",
    "2024 Event Dates": "April 13-14 and 20-21, 2024",
    "Link": "https://sfcherryblossom.org",
    "Description": "The Northern California Cherry Blossom Festival® (NCCBF) is one of California’s most prominent celebrations of Asian traditions.  Each year, over 220,000 people attend this dazzling display showcasing the vibrant colors and grace of the Japanese culture, and the rich heritage and diversity of the Japanese American community.  Please join us as an attendee, volunteer, and/or sponsor of this popular Japanese American community event. All are welcome to join in the festivities as we celebrate the blooming of the cherry blossoms and Japanese and Japanese American culture.  The Festival features Japanese cultural performances, traditional arts, live music, the annual Queen Program, and more.  This event is free and open to the public, made possible by the generous donations and support from our corporate and community sponsors and Festival supporters. The NCCBF is one of the largest cherry blossom festivals outside of Japan, second to the festival in Washington, D.C., and held at one of three remaining officially designated Japantowns in the United States.  This mid-April Festival takes place over two weekends, symbolizing the arrival of spring and cherry blossoms in the famously fog-shrouded San Francisco."
  },
  {
    "Latitude": 40.92016069,
    "Longitude": -74.2126791,
    "HeaderImg": "images/essex_sakura.jpg",
    "Name": "Essex County Cherry Blossom Festival (Newark)",
    "Address": "& Park Avenue, Lake St, Newark, NJ 07104",
    "2024 Event Dates": "April 6-14, 2024",
    "Link": "https://essexcountyparks.org/parks/branch-brook-park/calendar/2024-essex-county-cherry-blossom-festival",
    "Description": "Enjoy a family day in New Jersey’s pinkest park! A packed schedule of events includes Japanese cultural demonstrations, children's activities, live music, a crafter's marketplace, food and more! Branch Brook Park, which runs through Belleville and Newark, features more than 5,200 Japanese cherry blossom trees that burst into full bloom during the annual Essex County Cherry Blossom Festival, being held April 6 – 14, 2024. The festival kicks off with the action-packed Cherry Blossom Challenge Bike Race. Other festival favorites (in addition to admiring the countless blossoms and fantastic photo ops) include the Cherry Blossom 10K Run, Essex County Family Day, the 1-Mile Fun Run/Walk and Bloomfest! featuring live music, fun for the kids, crafters, and Japanese cultural demonstrations. Of course, it’s also a great time to enjoy lunch in the park under a canopy of blooms or learn about the trees during an audio tour via your cell phone."
  },
  {
      "Latitude": 39.98157488,
      "Longitude": -75.21291404,
      "HeaderImg": "images/philly_sakura.jpg",
      "Name": "Subaru Cherry Blossom Festival of Greater Philadelphia (Philadelphia)",
      "Address": "Lansdowne Dr &, Horticultural Dr, Philadelphia, PA 19131",
      "2024 Event Dates": "April 13-14, 2024",
      "Link": "https://japanphilly.org/programs/festivals/cherryblossom/",
      "Description": "Featuring a variety of events throughout the city, this yearly festival brings a taste of Japan to Philadelphia and highlights the beauty of Japanese sakura—the flowering cherry trees that brighten city streets and parks with their distinctive pink and white blossoms. JASGP is a private nonprofit organization that has inspired mutual curiosity, understanding, and collaboration between Japan and Philadelphia for more than 30 years through art, business, and culture. We operate: Shofuso Japanese Cultural Center hosting over 40,000 visitors annually; produce the Subaru Cherry Blossom Festival with over 30,000 attendees; present a US-Japan Business and Public Policy Series; and provide Japanese arts, business, and cultural educational programming for all ages."
  },
  {
      "Latitude": 36.16582948769876,
      "Longitude": -86.77858101767616,
      "HeaderImg": "images/nasheville_sakura.png",
      "Name": "Nashville Cherry Blossom Festival (Nashville)",
      "Address": "Union St & 3rd Ave N, Nashville, TN 37201",
      "2024 Event Dates": "April 13th, 2024",
      "Link": "https://www.nashvillecherryblossomfestival.org/",
      "Description": "The Nashville Cherry Blossom Festival is a family-friendly celebration of spring and Japanese culture on the front lawn of the Metro Courthouse at Nashville Public Square. Admission is free. The Festival begins at 9:30 a.m. with the Cherry Blossom Walk. The 2.5-mile course begins and ends at Nashville Public Square and follows the Cumberland River Greenway, looping at Sister Cities’ Magdeburg Connector to Morgan Park in Germantown. Festival highlights include traditional and contemporary Japanese music and dance, a roving “Candyman,” martial arts demonstrations, art, anime, children’s activities, sumo-suit wrestling, a Cosplay Contest, the annual Pups in Pink Parade and a variety of Japanese cuisine featuring special menus from some of Nashville’s favorite food trucks. The Nashville Cherry Blossom Festival and Walk is a joint undertaking of the Japan-America Society of Tennessee, the Consulate-General of Japan in Nashville and Metropolitan Government of Nashville and Davidson County. Funding is provided by civic-minded corporate sponsors and individual donors. Tax deductible donations may be made online."
  },
  {
      "Latitude": 47.59833210873071,
      "Longitude": -122.322796416985,
      "HeaderImg": "images/seattle_sakura.png",
      "Name": "Sakura Matsuri (Seattle)",
      "Address": "719 S. King Street, Seattle, Washington, 98104",
      "2024 Event Dates": "April 13th, 2024",
      "Link": "https://www.wingluke.org/eventscalendar/sakuramatsuri",
      "Description": "HANAMI: April 7-12, Locations: Kobe Terrace Park, Little Saigon. While the Sakura (Cherry Blossoms) are in bloom, we invite you to Kobe Terrace Park for your Hanami picnics! Just be mindful to not climb our delicate trees! SAKURA MATSURI DAY- April 13, Location: Nihonmachi / Japantown. Spend the afternoon in Nihonmachi and enjoy a host of activations including live music performances at neighborhood venues, art installations, food specials, and photo contest giveaways! For the complete list of venues and activations, visit @japantownseattle on Instagram."
  },
  {
      "Latitude": 40.68843222,
      "Longitude": -73.96194909,
      "HeaderImg": "images/brooklyn_sakura.webp",
      "Name": "Weekends in Bloom (Brooklyn)",
      "Address": "1000 Washington Avenue Brooklyn, NY 11225",
      "2024 Event Dates": "April 27-May 12, 2024",
      "Link": "https://www.bbg.org/visit/event/weekends_in_bloom_2024",
      "Description": "Celebrate cherry blossom season and all the spring blooms at Brooklyn Botanic Garden with casual, pop-up music and dance performances, morning programming for kids and families in the Discovery Garden, and Garden tours. Cherry trees usually begin to flower in early April. An individual tree may only bloom for a week or two, depending on the weather. Of course, if they were in bloom all the time, they wouldn’t be so special."
  },
  {
    "Latitude": 41.118047113174136,
    "Longitude": -85.10821524244643,
    "HeaderImg": "images/fortwayne_sakura.jpg",
    "Name": "Cherry Blossom Festival (Fort Wayne)",
    "Address": "Walb Student Union, Union Cir Dr, Fort Wayne, IN 46815",
    "2024 Event Dates": "May 19th, 2024",
    "Link": "https://www.cherryblossomfw.com/",
    "Description": "What do you think of when you hear Japan? Cherry blossoms, kimono-clad ladies, exotic musical instruments, chopsticks, sushi, samurai, martial arts, tea ceremony, origami, silk, anime characters, bonsai trees. The Fort Wayne Cherry Blossom Festival has it all! For 17 years we have introduced Japanese culture in many forms to Northeast Indiana and the surrounding states. Do you enjoy watching Japanese folk dancing? We have it.  How about the amazing sound of the Taiko drums? We have it.  Are you interested in traditional Japanese Koto music or contemporary Classical Japanese music? We will be bringing in favorite artists from past years, and hope to offer some new talent for 2025. At our festival, you can not only draw Anime, but dress up as your favorite Anime character for the Cosplay contest. You can try your hand at creating a Haiku poem in the Haiku contest too. Would you like to learn about the Tea Ceremony? You can.  Perhaps you would like to see a beautiful kimono close up or try one on for photos? You can do it here.  Are you a crafty person? Come learn how to make beautiful paper creations. Perhaps you like ACTION! Watch the Martial Arts demonstrations.  Have you ever wondered how those tiny bonsai trees are developed? Come and learn. Kendama expert, Michael Tsugawa, will be invited to again demonstrate the art of Kendama, and you will be able to buy your own kendama as well. What about the taste of Japanese food? Our food vendors offer a variety of taste adventures, including curry, ramen,  yakisoba, lavendar-flavored ice cream and more! And to help you remember your experiences, we have many vendors selling all things “Japanese”, from simple souvenirs to kimonos direct from Japan.  More at MARKET PLACE."
  }
]